mysql中将小数分为:浮点型和定点型
浮点型,可能丢失精度
浮点数通常应用于量大,不太精确的数字

float   单精度 4个字节存储数据,能表示的数据范围比整形大得多
        只能表示大概7个左右的精度,7位数以内大概是精确地,超出7位不一定

        基本语法
        float : 表示不指定小数位数
        float(M,D) : 表示一共存储M个有效数字,其中小数部分占D位
        folat(10,3) : 整数部分7位,小数3位

        create table mb_float1(
            f1 float,
            f2 float(10,3)
        )charset utf8;

        //正常输入
        insert into mb_float1 values(10.5424,1234567.123);
        +---------+-------------+
        | f1      | f2          |
        +---------+-------------+
        | 10.5424 | 1234567.125 |  精度有损失,结果不对(按照四舍五入)
        +---------+-------------+

        //超出位数
        insert into mb_float1 values(10.5424,12345678910.1547);
        Out of range value for column 'f2' at row 1 //超出指定位数会报错

        //超出精度
        insert into mb_float1 values(10.5424,12345.15474);
        +---------+-------------+
        | f1      | f2          |
        +---------+-------------+
        | 10.5424 | 1234567.125 |
        | 10.5424 |   12345.155 |   //精度损失了
        +---------+-------------+

        insert into mb_float1 values(10.24,9999999.99);
        +---------+--------------+
        | f1      | f2           |
        +---------+--------------+
        | 10.5424 |  1234567.125 |
        | 10.5424 |    12345.155 |
        |   10.24 | 10000000.000 |  //用户不能直接输入超过指定整数大小的数字,
        +---------+--------------+  //但是如果是因为进位导致的,系统自己承担

        //科学计数法
        10e5 相当于 10^5

double  双精度 8个字节存储数据
        精度只有15位左右

定点数:能够保持小数点精确(小数部分不一定精确,整数部分一定精确)
decimal 定点数,系统自动根据存储的数据来分配空间,每9个数据位就会分配4个字节来存储,整数和小数部分分开

decimal(M,D) M总长度,极限65 D小数长度,最长30位

1,创建表与浮点数对比
    create table mb_decimal1(
        f1 float(10,2),
        d1 decimal(10,2)
    )charset utf8;

2.正常数据
    insert into mb_decimal1 values(12345678.90,12345678.90);

    mysql> select * from mb_decimal1;
    +-------------+-------------+
    | f1          | d1          |
    +-------------+-------------+
    | 12345679.00 | 12345678.90 |
    +-------------+-------------+
      f1精度损失了

3.最大数据
insert into mb_decimal1 values(99999999.99,99999999.99);

    mysql> select * from mb_decimal1;
    +--------------+-------------+
    | f1           | d1          |
    +--------------+-------------+
    |  12345679.00 | 12345678.90 |
    | 100000000.00 | 99999999.99 |
    +--------------+-------------+
     前面进位,后面没变化

4.尝试定点数四舍五入
    insert into mb_decimal1 values(99999999.99,99999999.999);
    1264 - Out of range value for column 'd1' at row 1
    定点数如果整数部分进位超出长度会报错,不能存进去

涉及到钱一般用decimal