1 表子查询:   返回的结果是多行多列,表字查询和行子查询非常相近,行子查询要产生行元素,二表子查询没有
    行子查询用于where条件判断:where子查询
    表子查询用于from:from子查询

    查询得到的多行多列信息也可以使用 in 来进行匹配


2 语法
    1) 子查询结果作为被查询数据表

        select 字段表 from (子查询) as 别名 [where] [group by] [having] [limit];

        1.将每个班分数最高的学生排在最前面
        2.针对结果进行group by:保留每组第一个

        group by只返回第一个字段
        select * from (select * from students1 order by score desc) as s1 group by class;

        select * from (select * from students1 limit 5) as s1 where s1.id=1;
        +----+------+------+-----+-------+-------+
        | id | name | sex  | age | class | score |
        +----+------+------+-----+-------+-------+
        |  1 | 赵一 | male |  15 |     1 |    58 |
        +----+------+------+-----+-------+-------+

    2) 子查询结果被用作where的条件
        案例:
        A. 查询与 "鹿杖客" , "宋远桥" 的职位和薪资相同的员工信息
        分解为两步执行:
        ①. 查询 "鹿杖客" , "宋远桥" 的职位和薪资
            select job, salary from m_emp where name = '鹿杖客' or name = '宋远桥';
            +------+--------+
            | job  | salary |
            +------+--------+
            | 职员 |   3750 |
            | 销售 |   4600 |
            +------+--------+

        ②. 查询与 "鹿杖客" , "宋远桥" 的职位和薪资相同的员工信息
            select * from m_emp where (job,salary) in ( select job, salary from m_emp where name = '鹿杖客' or name = '宋远桥' );
            +----+--------+-----+------+--------+------------+-----------+---------+
            | id | name   | age | job  | salary | entrydate  | managerid | dept_id |
            +----+--------+-----+------+--------+------------+-----------+---------+
            | 11 | 鹿杖客 |  56 | 职员 |   3750 | 2006-10-03 |        10 |       2 |
            | 12 | 鹤笔翁 |  19 | 职员 |   3750 | 2007-05-09 |        10 |       2 |
            | 15 | 俞莲舟 |  38 | 销售 |   4600 | 2004-10-12 |        14 |       4 |
            | 16 | 宋远桥 |  40 | 销售 |   4600 | 2004-10-12 |        14 |       4 |
            +----+--------+-----+------+--------+------------+-----------+---------+

        B. 查询入职日期是 "2006-01-01" 之后的员工信息 , 及其部门信息
        分解为两步执行:
        ①. 入职日期是 "2006-01-01" 之后的员工信息
            select * from m_emp where entrydate > '2006-01-01';
            +----+--------+-----+------+--------+------------+-----------+---------+
            | id | name   | age | job  | salary | entrydate  | managerid | dept_id |
            +----+--------+-----+------+--------+------------+-----------+---------+
            |  8 | 周芷若 |  19 | 会计 |  48000 | 2006-06-02 |         7 |       3 |
            |  9 | 丁敏君 |  23 | 出纳 |   5250 | 2009-05-13 |         7 |       3 |
            | 11 | 鹿杖客 |  56 | 职员 |   3750 | 2006-10-03 |        10 |       2 |
            | 12 | 鹤笔翁 |  19 | 职员 |   3750 | 2007-05-09 |        10 |       2 |
            | 13 | 方东白 |  19 | 职员 |   5500 | 2009-02-12 |        10 |       2 |
            | 17 | 陈友谅 |  42 | NULL |   2000 | 2011-10-12 |         1 | NULL    |
            +----+--------+-----+------+--------+------------+-----------+---------+

        ②. 查询这部分员工, 对应的部门信息;
            select e.*,d.* from (select * from m_emp where entrydate>'2006-01-01') e left join m_dept d on e.dept_id=d.id;
            select e.*,d.* from m_emp e left join m_dept d on e.dept_id=d.id where e.entrydate>'2006-01-01';
            +----+--------+-----+------+--------+------------+-----------+---------+------+--------+
            | id | name   | age | job  | salary | entrydate  | managerid | dept_id | id   | name   |
            +----+--------+-----+------+--------+------------+-----------+---------+------+--------+
            |  8 | 周芷若 |  19 | 会计 |  48000 | 2006-06-02 |         7 |       3 |    3 | 财务部 |
            |  9 | 丁敏君 |  23 | 出纳 |   5250 | 2009-05-13 |         7 |       3 |    3 | 财务部 |
            | 11 | 鹿杖客 |  56 | 职员 |   3750 | 2006-10-03 |        10 |       2 |    2 | 市场部 |
            | 12 | 鹤笔翁 |  19 | 职员 |   3750 | 2007-05-09 |        10 |       2 |    2 | 市场部 |
            | 13 | 方东白 |  19 | 职员 |   5500 | 2009-02-12 |        10 |       2 |    2 | 市场部 |
            | 17 | 陈友谅 |  42 | NULL |   2000 | 2011-10-12 |         1 | NULL    | NULL | NULL   |
            +----+--------+-----+------+--------+------------+-----------+---------+------+--------+

        使用隐式内连接只有5行,缺少了没有部分的员工信息
            select e.*,d.* from m_emp e, m_dept d where e.dept_id=d.id and e.entrydate > '2006-01-01';
            +----+--------+-----+------+--------+------------+-----------+---------+----+--------+
            | id | name   | age | job  | salary | entrydate  | managerid | dept_id | id | name   |
            +----+--------+-----+------+--------+------------+-----------+---------+----+--------+
            |  8 | 周芷若 |  19 | 会计 |  48000 | 2006-06-02 |         7 |       3 |  3 | 财务部 |
            |  9 | 丁敏君 |  23 | 出纳 |   5250 | 2009-05-13 |         7 |       3 |  3 | 财务部 |
            | 11 | 鹿杖客 |  56 | 职员 |   3750 | 2006-10-03 |        10 |       2 |  2 | 市场部 |
            | 12 | 鹤笔翁 |  19 | 职员 |   3750 | 2007-05-09 |        10 |       2 |  2 | 市场部 |
            | 13 | 方东白 |  19 | 职员 |   5500 | 2009-02-12 |        10 |       2 |  2 | 市场部 |
            +----+--------+-----+------+--------+------------+-----------+---------+----+--------+