1 外连接
    outer join,按照某一张表作为主表(表中所有记录在最后都会保留),根据条件
    去连接另外一张表,得到目标数据

    分为两种:左外连接(left join):   左表示主表
             右外连接(right join):  右表示主表

5 原理
    (1) 确定连接主表,左连接是 left join左边的表作为主表,right join 就是右边的为主表
    (2) 拿主表的每一条记录,去匹配另外一张表(从表)的每一条记录
    (3) 如果满足匹配条件:保留;不满足即不保留
    (4) 如果主表记录在从表中一条都没有匹配成功,那么也要保留该记录,从表对应的字段值为null

3 语法
    左连接: 主表 left join 从表 on 连接条件
    右连接: 主表 right join 从表 on 连接条件

    左连接对应的主表数据在左边,
    右连接对应的主表数据在右边

4 特点
    (1) 主表记录一定保存
    (2) 左连接和右连接其实互相转换(左右位置互换),但是数据对应位置会改变

    select s1.id,s1.name,s2.id,s2.name from students1 as s1 left join students2 as s2 on s1.id=s2.id;
    +----+----------+------+--------+
    | id | name     | id   | name   |
    +----+----------+------+--------+
    |  1 | 赵一     |    1 | 赵一   |
    |  2 | 钱二     |    2 | 钱二   |
    |  3 | 孙三     |    3 | 孙三   |
    | 88 | 李四     | NULL | NULL   |
    |  5 | 周五     |    5 | 周五   |
    |  6 | 吴六     |    6 | 吴六   |
    |  7 | 郑七     |    7 | 郑七   |
    |  8 | 王八     |    8 | 王八   |
    |  9 | 冯九     |    9 | 冯九   |
    | 10 | 陈十     |   10 | 陈十   |
    | 11 | 褚十一   |   11 | 褚十一 |
    | 12 | 卫十二   | NULL | NULL   |
    | 13 | 蒋十三   |   13 | 蒋十三 |
    | 14 | 沈十四   |   14 | 沈十四 |
    | 15 | 韩十五   |   15 | 韩十五 |
    | 16 | 杨十六   |   16 | 杨十六 |
    | 17 | 朱十七   |   17 | 朱十七 |
    | 18 | 秦十八   |   18 | 秦十八 |
    | 19 | 尤十九   |   19 | 尤十九 |
    | 20 | 许二十   | NULL | NULL   |
    | 21 | 何二十一 | NULL | NULL   |
    | 22 | 吕二十二 | NULL | NULL   |
    | 23 | 施二十三 | NULL | NULL   |
    | 24 | 张二十四 | NULL | NULL   |
    | 25 | 孔二十五 | NULL | NULL   |
    | 26 | 曹二十六 | NULL | NULL   |
    +----+----------+------+--------+

5 应用
    非常常用的一种数据获取方式:作为数据获取作为主表以及其他数据(关联)

    select s1.id,s1.name,s2.id,s2.name from students1 as s1 right join students2 as s2 on s1.id=s2.id;\
    +------+--------+----+----------+
    | id   | name   | id | name     |
    +------+--------+----+----------+
    |    1 | 赵一   |  1 | 赵一     |
    |    2 | 钱二   |  2 | 钱二     |
    |    3 | 孙三   |  3 | 孙三     |
    | NULL | NULL   |  4 | 李四     |
    |    5 | 周五   |  5 | 周五     |
    |    6 | 吴六   |  6 | 吴六     |
    |    7 | 郑七   |  7 | 郑七     |
    |    8 | 王八   |  8 | 王八     |
    |    9 | 冯九   |  9 | 冯九     |
    |   10 | 陈十   | 10 | 陈十     |
    |   11 | 褚十一 | 11 | 褚十一   |
    | NULL | NULL   | 55 | 卫十二   |
    |   13 | 蒋十三 | 13 | 蒋十三   |
    |   14 | 沈十四 | 14 | 沈十四   |
    |   15 | 韩十五 | 15 | 韩十五   |
    |   16 | 杨十六 | 16 | 杨十六   |
    |   17 | 朱十七 | 17 | 朱十七   |
    |   18 | 秦十八 | 18 | 秦十八   |
    |   19 | 尤十九 | 19 | 尤十九   |
    | NULL | NULL   | 30 | 许二十   |
    | NULL | NULL   | 31 | 何二十一 |
    | NULL | NULL   | 32 | 吕二十二 |
    | NULL | NULL   | 33 | 施二十三 |
    | NULL | NULL   | 34 | 张二十四 |
    | NULL | NULL   | 35 | 孔二十五 |
    | NULL | NULL   | 36 | 曹二十六 |
    +------+--------+----+----------+

6 join 可以一次使用多个
    select * from jx_admin as a left join jx_admin_role as b on a.id=b.admin_id
    left join jx_role as c on b.role_id=c.id;

    +----+----------+----------------------------------+----+----------+---------+----+------------+
    | id | username | password                         | id | admin_id | role_id | id | role_name  |
    +----+----------+----------------------------------+----+----------+---------+----+------------+
    |  5 | admin    | 21232f297a57a5a743894a0e4a801fc3 |  5 |        5 |       1 |  1 | 超级管理员 |
    +----+----------+----------------------------------+----+----------+---------+----+------------+