1 流程结构:代码的执行顺序

2 if 基本语法
    if在MySQL中有两种基本用法
    (1) 用在select 查询当中,当做条件进行判断
        语法 if(条件,为真结果,为假结果) as 别名
            select *,if(age>15,'符合','不符合') as judge
            测试
            select *,if(age>15,'符合','不符合') as judge from students1;
            +----+----------+--------+-----+-------+-------+-------+
            | id | name     | sex    | age | class | score | judge |
            +----+----------+--------+-----+-------+-------+-------+
            |  2 | 钱二     | female |  16 |     2 |    55 | 符合  |
            |  3 | 孙三     | male   |  16 |     2 |    88 | 符合  |
            |  6 | 吴六     | male   |  16 |     1 |    75 | 符合  |
            |  7 | 郑七     | female |  16 |     1 |    87 | 符合  |
            |  8 | 王八     | male   |  16 |     3 |    88 | 符合  |
            | 11 | 褚十一   | female |  16 |     3 |    85 | 符合  |
            | 12 | 卫十二   | male   |  17 |     4 |    85 | 符合  |
            | 14 | 沈十四   | male   |  16 |     4 |    11 | 符合  |
            | 16 | 杨十六   | male   |  17 |     5 |    94 | 符合  |
            | 17 | 朱十七   | female |  19 |     5 |    60 | 符合  |
            | 18 | 秦十八   | male   |  17 |     4 |    11 | 符合  |
            | 20 | 许二十   | male   |  17 |     6 |    44 | 符合  |
            | 21 | 何二十一 | male   |  16 |     3 |    58 | 符合  |
            | 24 | 张二十四 | female |  18 |     6 |    88 | 符合  |
            +----+----------+--------+-----+-------+-------+-------+

            select *,if(age>15,'符合','不符合') as judge from students1 ;
            +----+----------+---------+-----+-------+-------+--------+
            | id | name     | sex     | age | class | score | judge  |
            +----+----------+---------+-----+-------+-------+--------+
            |  1 | 赵一     | male    |  15 |     1 |    58 | 不符合 |
            |  2 | 钱二     | female  |  16 |     2 |    55 | 符合   |
            |  3 | 孙三     | male    |  16 |     2 |    88 | 符合   |
            | 88 | 李四     | male    |  11 |     1 |   100 | 不符合 |
            |  5 | 周五     | female  |  15 |     2 |    88 | 不符合 |
            |  6 | 吴六     | male    |  16 |     1 |    75 | 符合   |
            |  7 | 郑七     | female  |  16 |     1 |    87 | 符合   |
            |  8 | 王八     | male    |  16 |     3 |    88 | 符合   |
            |  9 | 冯九     | male    |  14 |     3 |    45 | 不符合 |
            | 10 | 陈十     | female  |  14 |     4 |    85 | 不符合 |
            | 11 | 褚十一   | female  |  16 |     3 |    85 | 符合   |
            | 12 | 卫十二   | male    |  17 |     4 |    85 | 符合   |
            | 13 | 蒋十三   | female  |  13 |     5 |    33 | 不符合 |
            | 14 | 沈十四   | male    |  16 |     4 |    11 | 符合   |
            | 15 | 韩十五   | female  |  14 |     3 |    49 | 不符合 |
            | 16 | 杨十六   | male    |  17 |     5 |    94 | 符合   |
            | 17 | 朱十七   | female  |  19 |     5 |    60 | 符合   |
            | 18 | 秦十八   | male    |  17 |     4 |    11 | 符合   |
            | 19 | 尤十九   | female  |  11 |     5 | NULL  | 不符合 |
            | 20 | 许二十   | male    |  17 |     6 |    44 | 符合   |
            | 21 | 何二十一 | male    |  16 |     3 |    58 | 符合   |
            | 22 | 吕二十二 | female  |  15 |     6 |    59 | 不符合 |
            | 23 | 施二十三 | male    |  14 |     5 |    86 | 不符合 |
            | 24 | 张二十四 | female  |  18 |     6 |    88 | 符合   |
            | 25 | 孔二十五 | male    |  14 |     6 |    80 | 不符合 |
            | 26 | 曹二十六 | female  |  15 |     5 |    55 | 不符合 |
            +----+----------+---------+-----+-------+-------+--------+

    (2) 用在复杂的语句块中(函数/存储过程/触发器)
        基本语法
        IF 条件1 THEN
        .....
        ELSEIF 条件2 THEN -- 可选
        .....
        ELSE -- 可选
        .....
        END IF;

        符合语法:代码的判断存在两面性,两面都执行
        基本语法:
        if 条件1 then
            满足条件要执行的语句
        else
            不满足条件要执行的语句

            //如果还有其他分支,可以在里面再使用 if,else
            if 条件表达式 then
                满足条件要执行的语句
            else
                不满足条件要执行的语句
            end if;

        end if;


3 案例
    根据定义的分数score变量，判定当前分数对应的分数等级。
    score >= 85分，等级为优秀。
    score >= 60分 且 score < 85分，等级为及格。
    score < 60分，等级为不及格。

    create procedure p3()
    begin
        declare score int default 58;
        declare result varchar(10);
        if score >= 85 then
            set result := '优秀';
        elseif score >= 60 then
            set result := '及格';
        else
            set result := '不及格';
        end if;
        select result;
    end;
    call p3();

    上述的需求我们虽然已经实现了，但是也存在一些问题，比如：score 分数我们是在存储过程中定义
    死的，而且最终计算出来的分数等级，我们也仅仅是最终查询展示出来而已。
    那么我们能不能，把score分数动态的传递进来，计算出来的分数等级是否可以作为返回值返回呢？
    答案是肯定的，我们可以通过接下来所讲解的 参数 来解决上述的问题。