1 交叉连接
    将两张表的数据与另外一张表彼此交叉

2 原理
    (1) 从第一张表依次取出每一条记录
    (2) 取出一条记录之后与另外一张表的全部记录挨个匹配
    (3) 没有任何匹配调教,所有结果进行保留
    (4) 记录数 = 第一张表记录数 * 第二张表记录数 ;
        字段数 = 第一张表字段是 + 第二张表字段数(笛卡尔积)

3 语法
    表1 cross join 表2;

    select * from students1 cross join students2;
    select * from students1,students2; 和上一行相同

    *
    *
    | 125 | 南小鸟     | female |  17 |     4 |   100 | 11 | 褚十一    | female |  16 |     3 |    85 |
    | 125 | 南小鸟     | female |  17 |     4 |   100 | 13 | 蒋十三    | female |  13 |     5 |    33 |
    | 125 | 南小鸟     | female |  17 |     4 |   100 | 14 | 沈十四    | male   |  16 |     4 |    11 |
    | 125 | 南小鸟     | female |  17 |     4 |   100 | 15 | 韩十五    | female |  14 |     3 |    49 |
    *
    *
    *1764 rows in set (1.84 sec)


4 消除笛卡尔积
    where students1.id = students2.id

    --就是隐式内连接
    select * from students1,students2 where students1.id = students2.id;
    +----+--------+--------+-----+-------+-------+----+--------+--------+-----+-------+-------+
    | id | name   | sex    | age | class | score | id | name   | sex    | age | class | score |
    +----+--------+--------+-----+-------+-------+----+--------+--------+-----+-------+-------+
    |  1 | 赵一   | male   |  15 |     1 |    58 |  1 | 赵一   | male   |  15 |     1 |    58 |
    |  2 | 钱二   | female |  16 |     2 |    55 |  2 | 钱二   | female |  16 |     2 |    55 |
    |  3 | 孙三   | male   |  16 |     2 |    88 |  3 | 孙三   | male   |  16 |     2 |    88 |
    |  4 | 李四   | male   |  11 |     1 |   100 |  4 | 李四   | male   |  11 |     1 |   100 |
    |  5 | 周五   | female |  15 |     2 |    90 |  5 | 周五   | female |  15 |     2 |    88 |
    |  6 | 吴六   | male   |  16 |     1 |    75 |  6 | 吴六   | male   |  16 |     1 |    75 |
    |  7 | 郑七   | female |  16 |     1 |   100 |  7 | 郑七   | female |  16 |     1 |    87 |
    |  8 | 王八   | male   |  16 |     3 |    88 |  8 | 王八   | male   |  16 |     3 |    88 |
    |  9 | 冯九   | male   |  14 |     3 |    45 |  9 | 冯九   | male   |  14 |     3 |    45 |
    | 10 | 陈十   | female |  14 |     4 |    96 | 10 | 陈十   | female |  14 |     4 |    85 |
    | 11 | 褚十一 | female |  16 |     3 |    85 | 11 | 褚十一 | female |  16 |     3 |    85 |
    | 13 | 蒋十三 | female |  13 |     5 |    33 | 13 | 蒋十三 | female |  13 |     5 |    33 |
    | 14 | 沈十四 | male   |  16 |     4 |    11 | 14 | 沈十四 | male   |  16 |     4 |    11 |
    | 15 | 韩十五 | female |  14 |     3 |    49 | 15 | 韩十五 | female |  14 |     3 |    49 |
    | 16 | 杨十六 | male   |  17 |     5 |    94 | 16 | 杨十六 | male   |  17 |     5 |    94 |
    | 17 | 朱十七 | female |  19 |     5 |    60 | 17 | 朱十七 | female |  19 |     5 |    60 |
    | 18 | 秦十八 | male   |  17 |     4 |    11 | 18 | 秦十八 | male   |  17 |     4 |    11 |
    | 19 | 尤十九 | female |  11 |     5 | NULL  | 19 | 尤十九 | female |  11 |     5 |     0 |
    +----+--------+--------+-----+-------+-------+----+--------+--------+-----+-------+-------+
    18 rows in set (0.12 sec)

